outputs/azure/Loadbalancer/nginx/20000/ab_metrics7.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 51.120.122.67 (be patient)


Server Software:        nginx/1.29.2
Server Hostname:        51.120.122.67
Server Port:            80

Document Path:          /
Document Length:        21 bytes

Concurrency Level:      10
Time taken for tests:   50.654 seconds
Complete requests:      20000
Failed requests:        0
Total transferred:      5260000 bytes
HTML transferred:       420000 bytes
Requests per second:    394.83 [#/sec] (mean)
Time per request:       25.327 [ms] (mean)
Time per request:       2.533 [ms] (mean, across all concurrent requests)
Transfer rate:          101.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3 195.7      1   19573
Processing:     1   22 597.6      4   35834
Waiting:        1   22 597.6      4   35834
Total:          2   25 628.8      5   35835

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      6
  75%      7
  80%      7
  90%      8
  95%     10
  98%     15
  99%     21
 100%  35835 (longest request)