outputs/azure/Loadbalancer/nginx/20000/ab_metrics9.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 51.120.122.67 (be patient)


Server Software:        nginx/1.29.2
Server Hostname:        51.120.122.67
Server Port:            80

Document Path:          /
Document Length:        21 bytes

Concurrency Level:      10
Time taken for tests:   12.441 seconds
Complete requests:      20000
Failed requests:        0
Total transferred:      5260000 bytes
HTML transferred:       420000 bytes
Requests per second:    1607.64 [#/sec] (mean)
Time per request:       6.220 [ms] (mean)
Time per request:       0.622 [ms] (mean, across all concurrent requests)
Transfer rate:          412.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.6      1      39
Processing:     1    5   2.8      4      56
Waiting:        1    5   2.8      4      56
Total:          2    6   3.3      5      57

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      6
  75%      7
  80%      7
  90%      8
  95%     10
  98%     15
  99%     23
 100%     57 (longest request)